# test and learn how to work with pandas and numpy together

----

**find duplicates and delete them**

In [18]:
import pandas as pd
import numpy as np

test ={
    'k1': ['one', 'two'] * 3 + ['two'],
    'k2': [1, 1, 2, 3, 3, 4, 4]
}
df = pd.DataFrame(test)
df

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [19]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [20]:
df.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [21]:
df.drop([0,4],inplace=True)
df

    k1  k2
1  two   1
2  one   2
3  two   3
5  two   4
6  two   4

In [22]:
new_df = df.reset_index()
new_df

   index   k1  k2
0      1  two   1
1      2  one   2
2      3  two   3
3      5  two   4
4      6  two   4

In [23]:
new_df.drop(columns = ['index'],inplace=True)
new_df

    k1  k2
0  two   1
1  one   2
2  two   3
3  two   4
4  two   4

In [24]:
new_df.drop(columns = ['k1'])

   k2
0   1
1   2
2   3
3   4
4   4

## find the null value and drop them

In [29]:
import pandas as pd
import numpy as np
df = pd.read_csv('data.csv')
print(df.to_string())
print(df.info())

     Duration  Pulse  Maxpulse  Calories
0        60.0  110.0     130.0     409.1
1        60.0  117.0     145.0     479.0
2        60.0  103.0     135.0     340.0
3        45.0  109.0     175.0     282.4
4        45.0  117.0     148.0     406.0
5        60.0  102.0     127.0     300.0
6        60.0  110.0     136.0     374.0
7        45.0  104.0     134.0     253.3
8        30.0  109.0     133.0     195.1
9        60.0   98.0     124.0     269.0
10       60.0  103.0     147.0     329.3
11       60.0  100.0     120.0     250.7
12       60.0  106.0     128.0     345.3
13       60.0  104.0     132.0     379.3
14       60.0   98.0     123.0     275.0
15       60.0   98.0     120.0     215.2
16       60.0  100.0     120.0     300.0
17       45.0   90.0     112.0       NaN
18       60.0  103.0     123.0     323.0
19       45.0   97.0     125.0     243.0
20       60.0  108.0     131.0     364.2
21       45.0  100.0     119.0     282.0
22       60.0  130.0     101.0     300.0
23       45.0  105.0     132.0     246.0
24       60.0  102.0     126.0     334.5
25       60.0  100.0     120.0     250.0
26       60.0   92.0     118.0     241.0
27       60.0  103.0     132.0       NaN
28       60.0  100.0     132.0     280.0
29       60.0  102.0     129.0     380.3
30       60.0   92.0     115.0     243.0
31       45.0   90.0     112.0     180.1
32       60.0  101.0     124.0     299.0
33       60.0   93.0     113.0     223.0
34       60.0  107.0     136.0     361.0
35       60.0  114.0     140.0     415.0
36       60.0  102.0     127.0     300.0
37       60.0  100.0     120.0     300.0
38       60.0  100.0     120.0     300.0
39       45.0  104.0     129.0     266.0
40       45.0   90.0     112.0     180.1
41       60.0   98.0     126.0     286.0
42       60.0  100.0     122.0     329.4
43       60.0  111.0     138.0     400.0
44       60.0  111.0     131.0     397.0
45       60.0   99.0     119.0     273.0
46       60.0  109.0     153.0     387.6
47       45.0  111.0     136.0     300.0
48       45.0  108.0     129.0     298.0
49       60.0  111.0     139.0     397.6
50       60.0  107.0     136.0     380.2
51       80.0  123.0     146.0     643.1
52        NaN  106.0     130.0     263.0
53       60.0  118.0       NaN     486.0
54        NaN  136.0     175.0     238.0
55       60.0  121.0     146.0     450.7
56       60.0  118.0     121.0     413.0
57       45.0  115.0     144.0     305.0
58       20.0  153.0     172.0     226.4
59       45.0  123.0     152.0     321.0
60      210.0  108.0     160.0    1376.0
61      160.0  110.0     137.0    1034.4
62      160.0  109.0     135.0     853.0
63       45.0    NaN     141.0     341.0
64       20.0  110.0     130.0     131.4
65      180.0   90.0     130.0     800.4
66      150.0  105.0     135.0     873.4
67      150.0  107.0     130.0     816.0
68       20.0  106.0     136.0     110.4
69      300.0  108.0     143.0    1500.2
70      150.0   97.0     129.0    1115.0
71       60.0  109.0     153.0     387.6
72       90.0  100.0     127.0     700.0
73        NaN   97.0     127.0     953.2
74       45.0  114.0     146.0     304.0
75       90.0   98.0     125.0     563.2
76       45.0  105.0     134.0     251.0
77       45.0  110.0     141.0     300.0
78      120.0  100.0     130.0     500.4
79      270.0  100.0     131.0    1729.0
80       30.0  159.0     182.0     319.2
81       45.0  149.0     169.0     344.0
82       30.0  103.0     139.0     151.1
83      120.0  100.0     130.0     500.0
84       45.0  100.0     120.0     225.3
85        NaN  151.0       NaN     300.0
86       45.0  102.0     136.0     234.0
87      120.0  100.0     157.0    1000.1
88       45.0  129.0     103.0     242.0
89       20.0   83.0     107.0      50.3
90      180.0  101.0     127.0     600.1
91       45.0  107.0     137.0       NaN
92       30.0   90.0     107.0     105.3
93       15.0   80.0     100.0      50.5
94       20.0  150.0     171.0     127.4
95       20.0  151.0     168.0     229.4
96       30.0   95.0     128.0     128.2
97       25.0  152.0     168.0     244.2
98       30.0  109.0     131.0     188.2
99       90.0   93.0     124.0     604.1
100      20.0   95.0     112.0      77.7
101      90.0   90.0       NaN     500.0
102      90.0   90.0     100.0     500.0
103      90.0   90.0     100.0     500.4
104      30.0   92.0     108.0      92.7
105      30.0   93.0     128.0     124.0
106     180.0   90.0     120.0     800.3
107      30.0   90.0     120.0      86.2
108      90.0   90.0     120.0     500.3
109     210.0  137.0     184.0    1860.4
110      60.0  102.0     124.0     325.2
111      45.0  107.0     124.0     275.0
112      15.0  124.0     139.0     124.2
113      45.0  100.0     120.0     225.3
114      60.0  108.0     131.0     367.6
115      60.0  108.0     151.0     351.7
116      60.0  116.0     141.0     443.0
117      60.0   97.0     122.0     277.4
118      60.0  105.0     125.0       NaN
119      60.0  103.0     124.0     332.7
120      30.0  112.0     137.0     193.9
121      45.0  100.0     120.0     100.7
122      60.0  119.0       NaN     336.7
123      60.0  107.0     127.0     344.9
124      60.0  111.0     151.0     368.5
125      60.0   98.0     122.0     271.0
126      60.0   97.0     124.0     275.3
127      60.0  109.0     127.0     382.0
128      90.0   99.0     125.0     466.4
129      60.0  114.0     151.0     384.0
130      60.0  104.0     134.0     342.5
131      60.0  107.0     138.0     357.5
132      60.0  103.0     133.0     335.0
133      60.0  106.0     132.0     327.5
134      60.0  103.0     136.0     339.0
135      20.0  136.0     156.0     189.0
136      45.0  117.0     143.0     317.7
137      45.0  115.0     137.0     318.0
138      45.0  113.0     138.0     308.0
139      20.0  141.0     162.0     222.4
140      60.0  108.0     135.0     390.0
141      60.0   97.0     127.0       NaN
142      45.0  100.0     120.0     250.4
143      45.0  122.0     149.0     335.4
144      60.0  136.0     170.0     470.2
145      45.0  106.0     126.0     270.8
146      60.0  107.0     136.0     400.0
147      60.0  112.0     146.0     361.9
148      30.0  103.0     127.0     185.0
149      60.0  110.0     150.0     409.4
150      60.0  106.0     134.0     343.0
151      60.0  109.0     129.0     353.2
152      60.0  109.0     138.0     374.0
153      30.0  150.0     167.0     275.8
154      60.0  105.0     128.0     328.0
155      60.0  111.0     151.0     368.5
156      60.0   97.0     131.0     270.4
157      60.0  100.0     120.0     270.4
158      60.0  114.0     150.0     382.8
159      30.0   80.0     120.0     240.9
160      30.0   85.0     120.0     250.4
161      45.0   90.0     130.0     260.4
162      45.0   95.0     130.0     270.0
163      45.0  100.0     140.0     280.9
164      60.0  105.0     140.0     290.8
165      60.0  110.0     145.0     300.0
166      60.0  115.0     145.0     310.2
167      75.0  120.0     150.0     320.4
168      75.0  125.0     150.0     330.4
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  165 non-null    float64
 1   Pulse     168 non-null    float64
 2   Maxpulse  165 non-null    float64
 3   Calories  164 non-null    float64
dtypes: float64(4)
memory usage: 5.4 KB
None

In [33]:
df2 = df.dropna()
print(df2.info())

<class 'pandas.core.frame.DataFrame'>
Index: 156 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  156 non-null    float64
 1   Pulse     156 non-null    float64
 2   Maxpulse  156 non-null    float64
 3   Calories  156 non-null    float64
dtypes: float64(4)
memory usage: 6.1 KB
None

In [38]:
x = df['Calories'].mean()
df.fillna({'Calories':x}, inplace=True)
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  165 non-null    float64
 1   Pulse     168 non-null    float64
 2   Maxpulse  165 non-null    float64
 3   Calories  169 non-null    float64
dtypes: float64(4)
memory usage: 5.4 KB
None

In [39]:
z = df.mean()
df.fillna(z, inplace=True)
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    float64
 1   Pulse     169 non-null    float64
 2   Maxpulse  169 non-null    float64
 3   Calories  169 non-null    float64
dtypes: float64(4)
memory usage: 5.4 KB
None

---

In [40]:
from numpy import nan as NA
data = pd.DataFrame([[1., 6.5, 3., 8., 2.3], [1., NA, NA, 5, 1.4],
                     [NA, NA, 2,  NA, 4.5], [NA, 6.5, 3.,NA, 3.1],
                     [2.5, 8.1, NA, NA, 2], [NA , NA, NA , 4.2, NA],
                     [2, 5.2, 1.8, NA, 2.5]])
data.index = ['A','B','C','D','E','F','G']
data

     0    1    2    3    4
A  1.0  6.5  3.0  8.0  2.3
B  1.0  NaN  NaN  5.0  1.4
C  NaN  NaN  2.0  NaN  4.5
D  NaN  6.5  3.0  NaN  3.1
E  2.5  8.1  NaN  NaN  2.0
F  NaN  NaN  NaN  4.2  NaN
G  2.0  5.2  1.8  NaN  2.5

### Drop the rows with so much null values

In [51]:
data.dropna(thresh=3)

     0    1    2    3    4
A  1.0  6.5  3.0  8.0  2.3
B  1.0  NaN  NaN  5.0  1.4
D  NaN  6.5  3.0  NaN  3.1
E  2.5  8.1  NaN  NaN  2.0
G  2.0  5.2  1.8  NaN  2.5

In [52]:
data = pd.DataFrame([[1., 6.5, 3., NA, 2.3], [1., NA, NA, 5, 1.4],
                     [NA, NA, 2,  NA, 4.5], [NA, 6.5, 3.,NA, 3.1],
                     [2.5, 8.1, NA, NA, 2], [NA , NA, 1, NA , NA], 
                     [2, 5.2, 1.8, NA, 2.5],  [3, 2.1, 8.1, NA, 2.5],
                     [NA, 8.2, NA, NA, 1.9], [2, NA, 1.5, NA, 7.2]])
data.index = ['A','B','C','D','E','F','G','H','I','J']
data

     0    1    2    3    4
A  1.0  6.5  3.0  NaN  2.3
B  1.0  NaN  NaN  5.0  1.4
C  NaN  NaN  2.0  NaN  4.5
D  NaN  6.5  3.0  NaN  3.1
E  2.5  8.1  NaN  NaN  2.0
F  NaN  NaN  1.0  NaN  NaN
G  2.0  5.2  1.8  NaN  2.5
H  3.0  2.1  8.1  NaN  2.5
I  NaN  8.2  NaN  NaN  1.9
J  2.0  NaN  1.5  NaN  7.2

In [57]:
data.isna().sum()

0    4
1    4
2    3
3    9
4    1
dtype: int64

### Drop a column with more than %90 Null value

In [62]:
columns_to_drop = data.columns[data.isna().sum() / len(data) >= 0.9]

data.drop(columns=columns_to_drop, axis=1, inplace=True)
data

Index([], dtype='int64')

        0       1       2       4
A 1.00000 6.50000 3.00000 2.30000
B 1.00000     NaN     NaN 1.40000
C     NaN     NaN 2.00000 4.50000
D     NaN 6.50000 3.00000 3.10000
E 2.50000 8.10000     NaN 2.00000
F     NaN     NaN 1.00000     NaN
G 2.00000 5.20000 1.80000 2.50000
H 3.00000 2.10000 8.10000 2.50000
I     NaN 8.20000     NaN 1.90000
J 2.00000     NaN 1.50000 7.20000

# Time Series

In [66]:
from datetime import *
today = date.today()
print(today.year, today.month, today.day, today.weekday())

2024 11 3 6

In [68]:
t_now = time(23,14,5,10)
t_now

datetime.time(23, 14, 5, 10)

In [69]:
print(t_now.hour)
print(t_now.minute)
print(t_now.second)
print(t_now.microsecond)

23
14
5
10

In [75]:
now = datetime.now()
now

datetime.datetime(2024, 11, 3, 20, 19, 22, 347833)

In [73]:
now.year, now.month, now.day, now.weekday()

(2024, 11, 3, 6)

In [76]:
t1 = date.today()
t2 = date(2025, 5, 6)
t2 - t1

datetime.timedelta(days=184)

In [77]:
date_in_string = "2024-08-03"

date_in_datetime = datetime.strptime(date_in_string,'%Y-%m-%d')
date_in_datetime

datetime.datetime(2024, 8, 3, 0, 0)

In [78]:
times = [datetime(2021,8,24, 12, 24), datetime(2021,9,2, 23, 49), datetime(2021,9,10, 2, 15), datetime(2021,8,30, 16, 35),\
         datetime(2021,9,4, 15, 40), datetime(2021,9,14, 18, 0), datetime(2021,9,12, 21, 0), datetime(2021,9,17, 20, 12),\
         datetime(2021,9,1, 7, 4), datetime(2021,9,10, 14, 20)]

df = pd.DataFrame()
df['time'] = times
df['area'] = [2, 4, 10, 4, 3, 1, 7, 5, 2, 8]
print(df)

                 time  area
0 2021-08-24 12:24:00     2
1 2021-09-02 23:49:00     4
2 2021-09-10 02:15:00    10
3 2021-08-30 16:35:00     4
4 2021-09-04 15:40:00     3
5 2021-09-14 18:00:00     1
6 2021-09-12 21:00:00     7
7 2021-09-17 20:12:00     5
8 2021-09-01 07:04:00     2
9 2021-09-10 14:20:00     8

In [81]:
dawn = time(hour=7,minute=0,second=0)
morning = time(hour=11,minute=0,second=0)
noon = time(hour=15,minute=0,second=0)
afternoon = time(hour=19,minute=0,second=0)

def discretize_time (time) :
  if time.time() < dawn : 
    return "dawn"
  elif time.time() < morning :
    return "morning"
  elif time.time() < noon :
    return "noon"
  elif time.time() < afternoon :
    return "afternoon"
  else : return "night"

df['time'] = df.time.apply(discretize_time)
df

        time  area
0       noon     2
1      night     4
2       dawn    10
3  afternoon     4
4  afternoon     3
5  afternoon     1
6      night     7
7      night     5
8    morning     2
9       noon     8

# cut in strings

In [82]:
df = pd.DataFrame()
df['name'] = ["helma","sajede","ali","hossein","mohsen","haniye","hasan","sajjad"]
df['age'] = [5, 15, 12, 60, 35, 17, 71, 23]
print(df)

      name  age
0    helma    5
1   sajede   15
2      ali   12
3  hossein   60
4   mohsen   35
5   haniye   17
6    hasan   71
7   sajjad   23

In [83]:
bins = [1, 11, 18, 35, 50, 100]
labels = ["child", "teenager", "young", "middle_aged", "old"]
df['age'] = pd.cut(df.age, bins, labels=labels)
df

      name       age
0    helma     child
1   sajede  teenager
2      ali  teenager
3  hossein       old
4   mohsen     young
5   haniye  teenager
6    hasan       old
7   sajjad     young